{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "import pandas as pd\n",
    "from py2neo import Graph, Node, Relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Connection Successful!\n"
     ]
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "# Define connection details\n",
    "uri = \"bolt://localhost:7687\"\n",
    "username = \"neo4j\"\n",
    "password = \"logneo123\"  # Replace with the password you set\n",
    "\n",
    "# Create a driver instance\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "\n",
    "# Function to test connection\n",
    "def test_connection():\n",
    "    with driver.session() as session:\n",
    "        result = session.run(\"RETURN 'Connection Successful!' AS message\")\n",
    "        for record in result:\n",
    "            print(record[\"message\"])\n",
    "\n",
    "# Run the test function\n",
    "if __name__ == \"__main__\":\n",
    "    test_connection()\n",
    "\n",
    "# Close the driver when done\n",
    "driver.close()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Connect to Neo4j\n",
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"qwertyuiop\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'EventId': '1TQ24VGTQ0QF1HVN7Q3EVR0RO', 'EventTime': '2022-12-01T09:48:02.82901', 'IngestTime': '2022-12-01T09:48:55.0758696Z', 'RequestId': '1TQ24VGTQ0QF1HVN7Q3EVR0RO', 'SourceIp': '3.224.122.159', 'HttpMethod': 'GET', 'HttpUrl': 'https://api.docdigitizer.com/api/v1/documents/7ad28068-6f38-4c1b-8c59-2207dd50b485', 'HttpAuth': 'API_KEY 9ffb', 'HttpAuthHash': '74dd77154e7f3618b72e47c501265152', 'Resource': 'DocumentResource.get', 'ResourceClass': 'DocumentResource.get', 'ResourceMethod': 'DocumentResource.get', 'Organization': 'f00716b5-e120-4699-b827-791d6e2a2565', 'App': 'f00716b5-e120-4699-b827-791d6e2a2565_app', 'User': None, 'Entity': 'f00716b5-e120-4699-b827-791d6e2a2565_app', 'TimestampReq': '2022-12-01 09:48:02.573556', 'TimestampResp': '2022-12-01 09:48:02.829010'}\n",
      "{'EventId': '1F3XGJX8M29G66C91A4R1GS2Y', 'EventTime': '2022-12-01T09:48:03.435022', 'IngestTime': '2022-12-01T09:48:55.0758723Z', 'RequestId': '1F3XGJX8M29G66C91A4R1GS2Y', 'SourceIp': '80.172.211.18', 'HttpMethod': 'GET', 'HttpUrl': 'https://api.docdigitizer.com/api/v1/documents/f9ed1939-264b-4f02-9bd3-a1ba516b529c', 'HttpAuth': 'API_KEY 70a8', 'HttpAuthHash': '28aaab35b90c70153b6fbf812df7887f', 'Resource': 'DocumentResource.get', 'ResourceClass': 'DocumentResource.get', 'ResourceMethod': 'DocumentResource.get', 'Organization': '859d79a1-fa30-4a69-9947-78f62ba4b12e', 'App': '859d79a1-fa30-4a69-9947-78f62ba4b12e_app', 'User': None, 'Entity': '859d79a1-fa30-4a69-9947-78f62ba4b12e_app', 'TimestampReq': '2022-12-01 09:48:02.732993', 'TimestampResp': '2022-12-01 09:48:03.435022'}\n",
      "{'EventId': '1VN2KGD2QUHXY1IE77MB2MRMX2', 'EventTime': '2022-12-01T09:48:03.559262', 'IngestTime': '2022-12-01T09:48:55.0758727Z', 'RequestId': '1VN2KGD2QUHXY1IE77MB2MRMX2', 'SourceIp': '3.224.122.159', 'HttpMethod': 'GET', 'HttpUrl': 'https://api.docdigitizer.com/api/v1/documents/a69d9c97-845c-450c-a0f7-48bc018dae59', 'HttpAuth': 'API_KEY 9ffb', 'HttpAuthHash': '74dd77154e7f3618b72e47c501265152', 'Resource': 'DocumentResource.get', 'ResourceClass': 'DocumentResource.get', 'ResourceMethod': 'DocumentResource.get', 'Organization': 'f00716b5-e120-4699-b827-791d6e2a2565', 'App': 'f00716b5-e120-4699-b827-791d6e2a2565_app', 'User': None, 'Entity': 'f00716b5-e120-4699-b827-791d6e2a2565_app', 'TimestampReq': '2022-12-01 09:48:03.450496', 'TimestampResp': '2022-12-01 09:48:03.559262'}\n",
      "{'EventId': '15QTE5QCTARTC1JBWA8TT7KKO4', 'EventTime': '2022-12-01T09:48:04.193295', 'IngestTime': '2022-12-01T09:48:55.0758731Z', 'RequestId': '15QTE5QCTARTC1JBWA8TT7KKO4', 'SourceIp': '3.224.122.159', 'HttpMethod': 'GET', 'HttpUrl': 'https://api.docdigitizer.com/api/v1/documents/ac50fd6d-12cb-4047-827b-f3f06b06c0af', 'HttpAuth': 'API_KEY 9ffb', 'HttpAuthHash': '74dd77154e7f3618b72e47c501265152', 'Resource': 'DocumentResource.get', 'ResourceClass': 'DocumentResource.get', 'ResourceMethod': 'DocumentResource.get', 'Organization': 'f00716b5-e120-4699-b827-791d6e2a2565', 'App': 'f00716b5-e120-4699-b827-791d6e2a2565_app', 'User': None, 'Entity': 'f00716b5-e120-4699-b827-791d6e2a2565_app', 'TimestampReq': '2022-12-01 09:48:04.095121', 'TimestampResp': '2022-12-01 09:48:04.193295'}\n",
      "{'EventId': 'OKHGPJF0LG23P69R1S2KH8BW', 'EventTime': '2022-12-01T09:48:04.367031', 'IngestTime': '2022-12-01T09:48:55.0758734Z', 'RequestId': 'OKHGPJF0LG23P69R1S2KH8BW', 'SourceIp': '3.224.122.159', 'HttpMethod': 'GET', 'HttpUrl': 'https://api.docdigitizer.com/api/v1/documents/c9200a8e-0832-4f93-94d2-4666d2e0bec3', 'HttpAuth': 'API_KEY 9ffb', 'HttpAuthHash': '74dd77154e7f3618b72e47c501265152', 'Resource': 'DocumentResource.get', 'ResourceClass': 'DocumentResource.get', 'ResourceMethod': 'DocumentResource.get', 'Organization': 'f00716b5-e120-4699-b827-791d6e2a2565', 'App': 'f00716b5-e120-4699-b827-791d6e2a2565_app', 'User': None, 'Entity': 'f00716b5-e120-4699-b827-791d6e2a2565_app', 'TimestampReq': '2022-12-01 09:48:04.223767', 'TimestampResp': '2022-12-01 09:48:04.367031'}\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "# Function to parse a single log entry\n",
    "def parse_log_entry(log_entry):\n",
    "    parts = log_entry.split(',', 3)\n",
    "    timestamp, message_code, event_id, payload = parts[0], parts[1], parts[2], parts[3]\n",
    "    payload_json = json.loads(payload)\n",
    "    b64_payload = json.loads(payload_json['b64Payload'])\n",
    "    return {\n",
    "        'EventId': payload_json['EventId'],\n",
    "        'EventTime': payload_json['EventTime'],\n",
    "        'IngestTime': payload_json['IngestTime'],\n",
    "        'RequestId': b64_payload['requestId'],\n",
    "        'SourceIp': b64_payload['sourceIp'],\n",
    "        'HttpMethod': b64_payload['httpMethod'],\n",
    "        'HttpUrl': b64_payload['httpUrl'],\n",
    "        'HttpAuth': b64_payload['httpAuth'],\n",
    "        'HttpAuthHash': b64_payload['httpAuthHash'],\n",
    "        'Resource': b64_payload['resource'],\n",
    "        'ResourceClass': b64_payload['resourceClass'],\n",
    "        'ResourceMethod': b64_payload['resourceMethod'],\n",
    "        'Organization': b64_payload['organization'],\n",
    "        'App': b64_payload['app'],\n",
    "        'User': b64_payload['user'],\n",
    "        'Entity': b64_payload['entity'],\n",
    "        'TimestampReq': b64_payload['timestamp_req'],\n",
    "        'TimestampResp': b64_payload['timestamp_resp']\n",
    "    }\n",
    "\n",
    "# Function to process a single log file\n",
    "def process_log_file(file_path):\n",
    "    parsed_data_list = []\n",
    "    with open(file_path, 'r') as file:\n",
    "        for line in file:\n",
    "            parsed_data = parse_log_entry(line.strip())\n",
    "            parsed_data_list.append(parsed_data)\n",
    "    return parsed_data_list\n",
    "\n",
    "# Function to process all log files in the given directory\n",
    "def process_log_directory(log_directory):\n",
    "    all_parsed_data = []\n",
    "    for root, dirs, files in os.walk(log_directory):\n",
    "        for file in files:\n",
    "            if file.endswith('.log'):\n",
    "                file_path = os.path.join(root, file)\n",
    "                parsed_data = process_log_file(file_path)\n",
    "                all_parsed_data.extend(parsed_data)\n",
    "    return all_parsed_data\n",
    "\n",
    "# Main execution\n",
    "log_directory = '/Users/omkarsadekar/Documents/NEU Study Material/NEU Study Material/XN Project/server_logs_customer'  \n",
    "all_parsed_data = process_log_directory(log_directory)\n",
    "\n",
    "# Example: print out the first 5 parsed log entries\n",
    "for entry in all_parsed_data[:5]:\n",
    "    print(entry)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Graph Model Description\n",
    "## Nodes\n",
    "### Event\n",
    "**Properties:**\n",
    "- `EventId`: Unique identifier for the event.\n",
    "- `EventTime`: Timestamp when the event occurred.\n",
    "- `IngestTime`: Timestamp when the event was ingested.\n",
    "### Request\n",
    "**Properties:**\n",
    "- `RequestId`: Unique identifier for the request.\n",
    "- `SourceIp`: IP address from which the request originated.\n",
    "- `HttpMethod`: HTTP method used (e.g., GET, POST).\n",
    "- `HttpUrl`: URL accessed by the request.\n",
    "- `HttpAuth`: Authentication method used.\n",
    "- `HttpAuthHash`: Hash of the authentication method.\n",
    "- `TimestampReq`: Timestamp when the request was made.\n",
    "- `TimestampResp`: Timestamp when the response was made.\n",
    "#### Organization\n",
    "**Properties:**\n",
    "- `OrganizationId`: Unique identifier for the organization.\n",
    "#### App\n",
    "**Properties:**\n",
    "- `AppId`: Unique identifier for the app.\n",
    "#### User\n",
    "**Properties:**\n",
    "- `UserId`: Unique identifier for the user.\n",
    "#### Entity\n",
    "**Properties:**\n",
    "- `EntityId`: Unique identifier for the entity.\n",
    "### Relationships\n",
    "### GENERATED_BY\n",
    "- **From:** Event\n",
    "- **To:** Request\n",
    "- **Description:** Indicates that an event was generated by a specific request.\n",
    "### BELONGS_TO\n",
    "- **From:** Request\n",
    "- **To:** Organization\n",
    "- **Description:** Indicates that a request belongs to a specific organization.\n",
    "### USED_BY\n",
    "- **From:** Request\n",
    "- **To:** App\n",
    "- **Description:** Indicates that a request was made by a specific app.\n",
    "### INITIATED_BY\n",
    "- **From:** Request\n",
    "- **To:** User\n",
    "- **Description:** Indicates that a request was initiated by a specific user.\n",
    "### ASSOCIATED_WITH\n",
    "- **From:** Request\n",
    "- **To:** Entity\n",
    "- **Description:** Indicates that a request is associated with a specific entity."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/0n/4y67mytn7gx0m219_th1k1jw0000gn/T/ipykernel_7525/1667257342.py:3: DeprecationWarning: Using a driver after it has been closed is deprecated. Future versions of the driver will raise an error.\n",
      "  with driver.session() as session:\n",
      "/var/folders/0n/4y67mytn7gx0m219_th1k1jw0000gn/T/ipykernel_7525/1667257342.py:5: DeprecationWarning: write_transaction has been renamed to execute_write\n",
      "  session.write_transaction(create_nodes_and_relationships, entry)\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[18], line 82\u001b[0m\n\u001b[1;32m     79\u001b[0m all_parsed_data \u001b[39m=\u001b[39m process_log_directory(log_directory)\n\u001b[1;32m     81\u001b[0m \u001b[39m# Populate Neo4j with parsed data\u001b[39;00m\n\u001b[0;32m---> 82\u001b[0m populate_neo4j(all_parsed_data)\n\u001b[1;32m     84\u001b[0m \u001b[39m# # Close the driver when done\u001b[39;00m\n\u001b[1;32m     85\u001b[0m \u001b[39m# driver.close()\u001b[39;00m\n",
      "Cell \u001b[0;32mIn[18], line 5\u001b[0m, in \u001b[0;36mpopulate_neo4j\u001b[0;34m(data)\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[39mwith\u001b[39;00m driver\u001b[39m.\u001b[39msession() \u001b[39mas\u001b[39;00m session:\n\u001b[1;32m      4\u001b[0m     \u001b[39mfor\u001b[39;00m entry \u001b[39min\u001b[39;00m data:\n\u001b[0;32m----> 5\u001b[0m         session\u001b[39m.\u001b[39;49mwrite_transaction(create_nodes_and_relationships, entry)\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_meta.py:221\u001b[0m, in \u001b[0;36m_make_warning_decorator.<locals>.decorator.<locals>.inner\u001b[0;34m(*args, **kwargs)\u001b[0m\n\u001b[1;32m    218\u001b[0m \u001b[39m@wraps\u001b[39m(f)\n\u001b[1;32m    219\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39minner\u001b[39m(\u001b[39m*\u001b[39margs, \u001b[39m*\u001b[39m\u001b[39m*\u001b[39mkwargs):\n\u001b[1;32m    220\u001b[0m     warning_func(message, stack_level\u001b[39m=\u001b[39m\u001b[39m2\u001b[39m)\n\u001b[0;32m--> 221\u001b[0m     \u001b[39mreturn\u001b[39;00m f(\u001b[39m*\u001b[39;49margs, \u001b[39m*\u001b[39;49m\u001b[39m*\u001b[39;49mkwargs)\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_sync/work/session.py:799\u001b[0m, in \u001b[0;36mSession.write_transaction\u001b[0;34m(self, transaction_function, *args, **kwargs)\u001b[0m\n\u001b[1;32m    765\u001b[0m \u001b[39m@deprecated\u001b[39m(\u001b[39m\"\u001b[39m\u001b[39mwrite_transaction has been renamed to execute_write\u001b[39m\u001b[39m\"\u001b[39m)\n\u001b[1;32m    766\u001b[0m \u001b[39m@NonConcurrentMethodChecker\u001b[39m\u001b[39m.\u001b[39mnon_concurrent_method\n\u001b[1;32m    767\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39mwrite_transaction\u001b[39m(\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    772\u001b[0m     \u001b[39m*\u001b[39margs: _P\u001b[39m.\u001b[39margs,  \u001b[39m*\u001b[39m\u001b[39m*\u001b[39mkwargs: _P\u001b[39m.\u001b[39mkwargs\n\u001b[1;32m    773\u001b[0m ) \u001b[39m-\u001b[39m\u001b[39m>\u001b[39m _R:\n\u001b[1;32m    774\u001b[0m \u001b[39m    \u001b[39m\u001b[39m\"\"\"Execute a unit of work in a managed write transaction.\u001b[39;00m\n\u001b[1;32m    775\u001b[0m \n\u001b[1;32m    776\u001b[0m \u001b[39m    .. note::\u001b[39;00m\n\u001b[0;32m   (...)\u001b[0m\n\u001b[1;32m    797\u001b[0m \u001b[39m        Method was renamed to :meth:`.execute_write`.\u001b[39;00m\n\u001b[1;32m    798\u001b[0m \u001b[39m    \"\"\"\u001b[39;00m\n\u001b[0;32m--> 799\u001b[0m     \u001b[39mreturn\u001b[39;00m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_run_transaction(\n\u001b[1;32m    800\u001b[0m         WRITE_ACCESS, TelemetryAPI\u001b[39m.\u001b[39;49mTX_FUNC,\n\u001b[1;32m    801\u001b[0m         transaction_function, args, kwargs\n\u001b[1;32m    802\u001b[0m     )\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_sync/work/session.py:554\u001b[0m, in \u001b[0;36mSession._run_transaction\u001b[0;34m(self, access_mode, api, transaction_function, args, kwargs)\u001b[0m\n\u001b[1;32m    552\u001b[0m tx \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_transaction\n\u001b[1;32m    553\u001b[0m \u001b[39mtry\u001b[39;00m:\n\u001b[0;32m--> 554\u001b[0m     result \u001b[39m=\u001b[39m transaction_function(tx, \u001b[39m*\u001b[39;49margs, \u001b[39m*\u001b[39;49m\u001b[39m*\u001b[39;49mkwargs)\n\u001b[1;32m    555\u001b[0m \u001b[39mexcept\u001b[39;00m asyncio\u001b[39m.\u001b[39mCancelledError:\n\u001b[1;32m    556\u001b[0m     \u001b[39m# if cancellation callback has not been called yet:\u001b[39;00m\n\u001b[1;32m    557\u001b[0m     \u001b[39mif\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_transaction \u001b[39mis\u001b[39;00m \u001b[39mnot\u001b[39;00m \u001b[39mNone\u001b[39;00m:\n",
      "Cell \u001b[0;32mIn[18], line 76\u001b[0m, in \u001b[0;36mcreate_nodes_and_relationships\u001b[0;34m(tx, entry)\u001b[0m\n\u001b[1;32m     70\u001b[0m \u001b[39mif\u001b[39;00m entry\u001b[39m.\u001b[39mget(\u001b[39m\"\u001b[39m\u001b[39mEntity\u001b[39m\u001b[39m\"\u001b[39m):\n\u001b[1;32m     71\u001b[0m     query \u001b[39m+\u001b[39m\u001b[39m=\u001b[39m \u001b[39m\"\"\"\u001b[39m\n\u001b[1;32m     72\u001b[0m \u001b[39m    WITH r\u001b[39m\n\u001b[1;32m     73\u001b[0m \u001b[39m    MATCH (e:Entity \u001b[39m\u001b[39m{\u001b[39m\u001b[39mEntityId: $Entity})\u001b[39m\n\u001b[1;32m     74\u001b[0m \u001b[39m    MERGE (r)-[:ASSOCIATED_WITH]->(e)\u001b[39m\n\u001b[1;32m     75\u001b[0m \u001b[39m    \u001b[39m\u001b[39m\"\"\"\u001b[39m\n\u001b[0;32m---> 76\u001b[0m tx\u001b[39m.\u001b[39;49mrun(query, entry)\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_sync/work/transaction.py:172\u001b[0m, in \u001b[0;36mTransactionBase.run\u001b[0;34m(self, query, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    169\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_results\u001b[39m.\u001b[39mappend(result)\n\u001b[1;32m    171\u001b[0m parameters \u001b[39m=\u001b[39m \u001b[39mdict\u001b[39m(parameters \u001b[39mor\u001b[39;00m {}, \u001b[39m*\u001b[39m\u001b[39m*\u001b[39mkwparameters)\n\u001b[0;32m--> 172\u001b[0m result\u001b[39m.\u001b[39;49m_tx_ready_run(query, parameters)\n\u001b[1;32m    174\u001b[0m \u001b[39mreturn\u001b[39;00m result\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_sync/work/result.py:171\u001b[0m, in \u001b[0;36mResult._tx_ready_run\u001b[0;34m(self, query, parameters)\u001b[0m\n\u001b[1;32m    167\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39m_tx_ready_run\u001b[39m(\u001b[39mself\u001b[39m, query, parameters):\n\u001b[1;32m    168\u001b[0m     \u001b[39m# BEGIN+RUN does not carry any extra on the RUN message.\u001b[39;00m\n\u001b[1;32m    169\u001b[0m     \u001b[39m# BEGIN {extra}\u001b[39;00m\n\u001b[1;32m    170\u001b[0m     \u001b[39m# RUN \"query\" {parameters} {extra}\u001b[39;00m\n\u001b[0;32m--> 171\u001b[0m     \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_run(query, parameters, \u001b[39mNone\u001b[39;49;00m, \u001b[39mNone\u001b[39;49;00m, \u001b[39mNone\u001b[39;49;00m, \u001b[39mNone\u001b[39;49;00m, \u001b[39mNone\u001b[39;49;00m, \u001b[39mNone\u001b[39;49;00m)\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_sync/work/result.py:221\u001b[0m, in \u001b[0;36mResult._run\u001b[0;34m(self, query, parameters, db, imp_user, access_mode, bookmarks, notifications_min_severity, notifications_disabled_classifications)\u001b[0m\n\u001b[1;32m    219\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_pull()\n\u001b[1;32m    220\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_connection\u001b[39m.\u001b[39msend_all()\n\u001b[0;32m--> 221\u001b[0m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_attach()\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_sync/work/result.py:409\u001b[0m, in \u001b[0;36mResult._attach\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    407\u001b[0m \u001b[39mif\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_exhausted \u001b[39mis\u001b[39;00m \u001b[39mFalse\u001b[39;00m:\n\u001b[1;32m    408\u001b[0m     \u001b[39mwhile\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_attached \u001b[39mis\u001b[39;00m \u001b[39mFalse\u001b[39;00m:\n\u001b[0;32m--> 409\u001b[0m         \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_connection\u001b[39m.\u001b[39;49mfetch_message()\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_sync/io/_common.py:178\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[0;34m(*args, **kwargs)\u001b[0m\n\u001b[1;32m    176\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39minner\u001b[39m(\u001b[39m*\u001b[39margs, \u001b[39m*\u001b[39m\u001b[39m*\u001b[39mkwargs):\n\u001b[1;32m    177\u001b[0m     \u001b[39mtry\u001b[39;00m:\n\u001b[0;32m--> 178\u001b[0m         func(\u001b[39m*\u001b[39;49margs, \u001b[39m*\u001b[39;49m\u001b[39m*\u001b[39;49mkwargs)\n\u001b[1;32m    179\u001b[0m     \u001b[39mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[39mas\u001b[39;00m exc:\n\u001b[1;32m    180\u001b[0m         \u001b[39massert\u001b[39;00m \u001b[39mnot\u001b[39;00m asyncio\u001b[39m.\u001b[39miscoroutinefunction(\u001b[39mself\u001b[39m\u001b[39m.\u001b[39m__on_error)\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_sync/io/_bolt.py:852\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    849\u001b[0m     \u001b[39mreturn\u001b[39;00m \u001b[39m0\u001b[39m, \u001b[39m0\u001b[39m\n\u001b[1;32m    851\u001b[0m \u001b[39m# Receive exactly one message\u001b[39;00m\n\u001b[0;32m--> 852\u001b[0m tag, fields \u001b[39m=\u001b[39m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49minbox\u001b[39m.\u001b[39;49mpop(\n\u001b[1;32m    853\u001b[0m     hydration_hooks\u001b[39m=\u001b[39;49m\u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49mresponses[\u001b[39m0\u001b[39;49m]\u001b[39m.\u001b[39;49mhydration_hooks\n\u001b[1;32m    854\u001b[0m )\n\u001b[1;32m    855\u001b[0m res \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_process_message(tag, fields)\n\u001b[1;32m    856\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39midle_since \u001b[39m=\u001b[39m monotonic()\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_sync/io/_common.py:72\u001b[0m, in \u001b[0;36mInbox.pop\u001b[0;34m(self, hydration_hooks)\u001b[0m\n\u001b[1;32m     71\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39mpop\u001b[39m(\u001b[39mself\u001b[39m, hydration_hooks):\n\u001b[0;32m---> 72\u001b[0m     \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_buffer_one_chunk()\n\u001b[1;32m     73\u001b[0m     \u001b[39mtry\u001b[39;00m:\n\u001b[1;32m     74\u001b[0m         size, tag \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_unpacker\u001b[39m.\u001b[39munpack_structure_header()\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_sync/io/_common.py:51\u001b[0m, in \u001b[0;36mInbox._buffer_one_chunk\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m     48\u001b[0m \u001b[39mwhile\u001b[39;00m \u001b[39mTrue\u001b[39;00m:\n\u001b[1;32m     49\u001b[0m     \u001b[39mwhile\u001b[39;00m chunk_size \u001b[39m==\u001b[39m \u001b[39m0\u001b[39m:\n\u001b[1;32m     50\u001b[0m         \u001b[39m# Determine the chunk size and skip noop\u001b[39;00m\n\u001b[0;32m---> 51\u001b[0m         receive_into_buffer(\u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_socket, \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_buffer, \u001b[39m2\u001b[39;49m)\n\u001b[1;32m     52\u001b[0m         chunk_size \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_buffer\u001b[39m.\u001b[39mpop_u16()\n\u001b[1;32m     53\u001b[0m         \u001b[39mif\u001b[39;00m chunk_size \u001b[39m==\u001b[39m \u001b[39m0\u001b[39m:\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_sync/io/_common.py:326\u001b[0m, in \u001b[0;36mreceive_into_buffer\u001b[0;34m(sock, buffer, n_bytes)\u001b[0m\n\u001b[1;32m    324\u001b[0m \u001b[39mwith\u001b[39;00m \u001b[39mmemoryview\u001b[39m(buffer\u001b[39m.\u001b[39mdata) \u001b[39mas\u001b[39;00m view:\n\u001b[1;32m    325\u001b[0m     \u001b[39mwhile\u001b[39;00m buffer\u001b[39m.\u001b[39mused \u001b[39m<\u001b[39m end:\n\u001b[0;32m--> 326\u001b[0m         n \u001b[39m=\u001b[39m sock\u001b[39m.\u001b[39;49mrecv_into(view[buffer\u001b[39m.\u001b[39;49mused:end], end \u001b[39m-\u001b[39;49m buffer\u001b[39m.\u001b[39;49mused)\n\u001b[1;32m    327\u001b[0m         \u001b[39mif\u001b[39;00m n \u001b[39m==\u001b[39m \u001b[39m0\u001b[39m:\n\u001b[1;32m    328\u001b[0m             \u001b[39mraise\u001b[39;00m \u001b[39mOSError\u001b[39;00m(\u001b[39m\"\u001b[39m\u001b[39mNo data\u001b[39m\u001b[39m\"\u001b[39m)\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_async_compat/network/_bolt_socket.py:493\u001b[0m, in \u001b[0;36mBoltSocket.recv_into\u001b[0;34m(self, buffer, nbytes)\u001b[0m\n\u001b[1;32m    492\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39mrecv_into\u001b[39m(\u001b[39mself\u001b[39m, buffer, nbytes):\n\u001b[0;32m--> 493\u001b[0m     \u001b[39mreturn\u001b[39;00m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_wait_for_io(\u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49m_socket\u001b[39m.\u001b[39;49mrecv_into, buffer, nbytes)\n",
      "File \u001b[0;32m~/Documents/NEU Study Material/NEU Study Material/Projects/Anomaly-Detection-and-Server-Load-Optimization/venv/lib/python3.11/site-packages/neo4j/_async_compat/network/_bolt_socket.py:468\u001b[0m, in \u001b[0;36mBoltSocket._wait_for_io\u001b[0;34m(self, func, *args, **kwargs)\u001b[0m\n\u001b[1;32m    466\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39m_wait_for_io\u001b[39m(\u001b[39mself\u001b[39m, func, \u001b[39m*\u001b[39margs, \u001b[39m*\u001b[39m\u001b[39m*\u001b[39mkwargs):\n\u001b[1;32m    467\u001b[0m     \u001b[39mif\u001b[39;00m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_deadline \u001b[39mis\u001b[39;00m \u001b[39mNone\u001b[39;00m:\n\u001b[0;32m--> 468\u001b[0m         \u001b[39mreturn\u001b[39;00m func(\u001b[39m*\u001b[39;49margs, \u001b[39m*\u001b[39;49m\u001b[39m*\u001b[39;49mkwargs)\n\u001b[1;32m    469\u001b[0m     timeout \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_socket\u001b[39m.\u001b[39mgettimeout()\n\u001b[1;32m    470\u001b[0m     deadline_timeout \u001b[39m=\u001b[39m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39m_deadline\u001b[39m.\u001b[39mto_timeout()\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "# Function to create nodes and relationships in Neo4j\n",
    "def populate_neo4j(data):\n",
    "    with driver.session() as session:\n",
    "        for entry in data:\n",
    "            session.write_transaction(create_nodes_and_relationships, entry)\n",
    "\n",
    "def create_nodes_and_relationships(tx, entry):\n",
    "    # Create Event node\n",
    "    tx.run(\"\"\"\n",
    "    MERGE (e:Event {EventId: $EventId})\n",
    "    SET e.EventTime = $EventTime, e.IngestTime = $IngestTime\n",
    "    \"\"\", entry)\n",
    "\n",
    "    # Create Request node\n",
    "    tx.run(\"\"\"\n",
    "    MERGE (r:Request {RequestId: $RequestId})\n",
    "    SET r.SourceIp = $SourceIp, r.HttpMethod = $HttpMethod, r.HttpUrl = $HttpUrl,\n",
    "        r.HttpAuth = $HttpAuth, r.HttpAuthHash = $HttpAuthHash, r.TimestampReq = $TimestampReq, \n",
    "        r.TimestampResp = $TimestampResp\n",
    "    \"\"\", entry)\n",
    "\n",
    "    # Conditionally create Organization node if OrganizationId is not null\n",
    "    if entry.get(\"Organization\"):\n",
    "        tx.run(\"\"\"\n",
    "        MERGE (o:Organization {OrganizationId: $Organization})\n",
    "        \"\"\", {\"Organization\": entry[\"Organization\"]})\n",
    "\n",
    "    # Conditionally create App node if AppId is not null\n",
    "    if entry.get(\"App\"):\n",
    "        tx.run(\"\"\"\n",
    "        MERGE (a:App {AppId: $App})\n",
    "        \"\"\", {\"App\": entry[\"App\"]})\n",
    "\n",
    "    # Conditionally create User node if UserId is not null\n",
    "    if entry.get(\"User\"):\n",
    "        tx.run(\"\"\"\n",
    "        MERGE (u:User {UserId: $User})\n",
    "        \"\"\", {\"User\": entry[\"User\"]})\n",
    "\n",
    "    # Conditionally create Entity node if EntityId is not null\n",
    "    if entry.get(\"Entity\"):\n",
    "        tx.run(\"\"\"\n",
    "        MERGE (e:Entity {EntityId: $Entity})\n",
    "        \"\"\", {\"Entity\": entry[\"Entity\"]})\n",
    "\n",
    "    # Create relationships\n",
    "    query = \"\"\"\n",
    "    MATCH (e:Event {EventId: $EventId})\n",
    "    MATCH (r:Request {RequestId: $RequestId})\n",
    "    MERGE (e)-[:GENERATED_BY]->(r)\n",
    "    \"\"\"\n",
    "    if entry.get(\"Organization\"):\n",
    "        query += \"\"\"\n",
    "        WITH r\n",
    "        MATCH (o:Organization {OrganizationId: $Organization})\n",
    "        MERGE (r)-[:BELONGS_TO]->(o)\n",
    "        \"\"\"\n",
    "    if entry.get(\"App\"):\n",
    "        query += \"\"\"\n",
    "        WITH r\n",
    "        MATCH (a:App {AppId: $App})\n",
    "        MERGE (r)-[:USED_BY]->(a)\n",
    "        \"\"\"\n",
    "    if entry.get(\"User\"):\n",
    "        query += \"\"\"\n",
    "        WITH r\n",
    "        MATCH (u:User {UserId: $User})\n",
    "        MERGE (r)-[:INITIATED_BY]->(u)\n",
    "        \"\"\"\n",
    "    if entry.get(\"Entity\"):\n",
    "        query += \"\"\"\n",
    "        WITH r\n",
    "        MATCH (e:Entity {EntityId: $Entity})\n",
    "        MERGE (r)-[:ASSOCIATED_WITH]->(e)\n",
    "        \"\"\"\n",
    "    tx.run(query, entry)\n",
    "# Main execution\n",
    "log_directory = '/Users/omkarsadekar/Documents/NEU Study Material/NEU Study Material/XN Project/server_logs_customer'\n",
    "all_parsed_data = process_log_directory(log_directory)\n",
    "\n",
    "# Populate Neo4j with parsed data\n",
    "populate_neo4j(all_parsed_data)\n",
    "\n",
    "# # Close the driver when done\n",
    "# driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[]\n"
     ]
    }
   ],
   "source": [
    "# Define the app_id you want to query\n",
    "app_id = 'lara.andrade-org_app'  # Replace with the actual AppId you want to query\n",
    "\n",
    "# Cypher query\n",
    "query = \"\"\"\n",
    "MATCH (u:User)-[:INITIATED_BY]->(r:Request)-[:USED_BY]->(a:App {AppId: $app_id})\n",
    "RETURN u.UserId AS UserId\n",
    "\"\"\"\n",
    "\n",
    "# Execute the query and get the results\n",
    "results = graph.run(query, app_id=app_id).data()\n",
    "\n",
    "print(results)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
